# Homebrew Bundle for Modern macOS Development Environment
# Install with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "nikitabobko/tap"
tap "bun-sh/tap"

# ===========================
# Core Development Tools
# ===========================

# Git and version control
brew "git"
brew "git-lfs"
brew "gh"           # GitHub CLI
brew "lazygit"      # Terminal UI for git commands

# Modern shell and terminal tools
brew "zsh"
brew "tmux"
brew "fzf"          # Fuzzy finder
brew "ripgrep"      # Fast grep alternative
brew "fd"           # Fast find alternative
brew "bat"          # Cat with syntax highlighting
brew "eza"          # Modern ls replacement
brew "tree"         # Directory tree display
brew "htop"         # Better top
brew "btop"         # Modern htop alternative

# Text editors and development
brew "neovim"       # Modern vim
cask "visual-studio-code"

# ===========================
# JavaScript/TypeScript Development
# ===========================

brew "bun-sh/tap/bun"   # Fast JavaScript runtime
brew "node"             # Node.js (backup/compatibility)
brew "fnm"             # Fast Node Manager

# ===========================
# Other Language Runtimes
# ===========================

# Python
brew "python@3.11"
brew "python@3.12"
brew "pipenv"
brew "poetry"

# Rust
brew "rust"
brew "cargo-edit"
brew "cargo-watch"

# Go
brew "go"
brew "golangci-lint"

# Ruby (for macOS scripting)
brew "ruby"
brew "rbenv"

# ===========================
# Database and Storage
# ===========================

brew "postgresql@15"
brew "redis"
brew "sqlite"

# ===========================
# System Tools and Utilities
# ===========================

# File operations
brew "rsync"
brew "wget"
brew "curl"
brew "jq"           # JSON processor
brew "yq"           # YAML processor
brew "xmlstarlet"   # XML processor

# Compression and archives
brew "unzip"
brew "zip"
brew "gzip"
brew "xz"
brew "p7zip"

# Networking
brew "nmap"
brew "netcat"
brew "telnet"
brew "ipcalc"

# System monitoring
brew "lsof"
brew "watch"
brew "pstree"

# ===========================
# Security and Encryption
# ===========================

brew "gnupg"
brew "openssh"
brew "openssl"
brew "age"          # Modern encryption
brew "sops"         # Secrets management

# ===========================
# DevOps and Cloud Tools
# ===========================

# Docker
cask "docker"

# Kubernetes
brew "kubectl"
brew "helm"
brew "k9s"          # Kubernetes CLI manager

# Cloud CLIs
brew "awscli"
brew "azure-cli"
brew "google-cloud-sdk"

# Infrastructure as Code
brew "terraform"
brew "packer"
brew "ansible"

# ===========================
# Window Management and UI
# ===========================

# AeroSpace window manager
cask "nikitabobko/tap/aerospace"

# Karabiner for key remapping
cask "karabiner-elements"

# ===========================
# Terminal and Development Apps
# ===========================

# Ghostty terminal
cask "ghostty"

# ===========================
# Fonts
# ===========================

# Nerd Fonts for terminal icons
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Design fonts
cask "font-inter"
cask "font-geist"
cask "font-geist-mono"

# ===========================
# Browsers and Communication
# ===========================

cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"

# ===========================
# Development Applications
# ===========================

# API development
cask "postman"
cask "insomnia"

# Database management
cask "tableplus"
cask "redis-insight"

# Design and prototyping
cask "figma"

# ===========================
# Productivity Tools
# ===========================

# Note taking and documentation
cask "obsidian"
cask "notion"

# File management
cask "the-unarchiver"
cask "keka"

# System utilities
cask "rectangle"        # Window management (backup)
cask "raycast"          # Spotlight replacement
cask "cleanmymac"       # System cleanup

# ===========================
# Optional Development Tools
# ===========================

# Virtualization
# cask "virtualbox"
# cask "vmware-fusion"

# Additional databases
# brew "mongodb-community"
# brew "elasticsearch"

# iOS development (uncomment if needed)
# mas "Xcode", id: 497799835
# cask "sf-symbols"
# cask "create-ml"

# Android development (uncomment if needed)
# cask "android-studio"

# ===========================
# Backup and Sync
# ===========================

# Cloud storage
cask "google-drive"
cask "dropbox"

# ===========================
# Entertainment (Optional)
# ===========================

# Media players
# cask "vlc"
# cask "spotify"

# ===========================
# Mac App Store Apps
# ===========================

# System utilities
mas "Amphetamine", id: 937984704         # Prevent sleep
mas "The Unarchiver", id: 425424353     # Archive extraction

# Productivity
mas "Things 3", id: 904280696           # Task management (optional)

# Development
mas "Xcode", id: 497799835              # iOS development (optional)

# ===========================
# VSCode Extensions (via mas)
# ===========================

# Install VSCode extensions programmatically
# These can be installed via a separate script after VSCode is installed